INSERT INTO institutes (name) 
VALUES ('Институт математики и информатики');

INSERT INTO groups (name, short_name, year, institute_id) 
VALUES 
    ('Информатика и вычислительная техника', 'Б-ИВТ-25-1', 2025, 1),
    ('Информатика и вычислительная техника', 'Б-ИВТ-25-2', 2025, 1),
    ('Фундаментальная информатика и информационные технологии', 'Б-ФИИТ-25', 2025, 1),
    ('Прикладная информатика', 'Б-ПИ-25-1', 2025, 1);


INSERT INTO students (surname, name, father_name, group_id) 
VALUES 
	('Друзьянов', 'Айсен', 'Николаевич', 3),
	('Ахолупке', 'Севану', NULL, 3),
    ('Баайагантай', 'Сандаар', NULL, 3),
    ('Васильев', 'Валерий', NULL, 3),
    ('Васильева', 'Татьяна', NULL, 3),
    ('Гаврильев', 'Егор', NULL, 3),
    ('Герасимов', 'Егор', NULL, 3),
    ('Егоров', 'Эдуард', NULL, 3),
    ('Жирков', 'Арсений', NULL, 3),
    ('Жуллярова', 'Анастасия', NULL, 3),
    ('Иванов', 'Аян', NULL, 3),
    ('Капустин', 'Вадим', NULL, 3),
    ('Манасытов', 'Ярослав', NULL, 3),
    ('Мосоркина', 'Айгылана', NULL, 3),
    ('Николаев', 'Уххан', NULL, 3),
    ('Павлов', 'Владислав', NULL, 3),
    ('Петухов', 'Тимур', NULL, 3),
    ('Слепцов', 'Иван', NULL, 3),
    ('Ушницкий', 'Айтал', NULL, 3),
    ('Федоров', 'Альберт', NULL, 3),
    ('Федотов', 'Владимир', NULL, 3),
    ('Хомподоев', 'Сандал', NULL, 3),
    ('Чабыкин', 'Олег', NULL, 3),
    ('Шалесная', 'Александра', NULL, 3),
    ('Шамаев', 'Егор', NULL, 3),
    ('Эверстов', 'Дмитрий', NULL, 3);

SELECT * FROM institutes;

SELECT * FROM groups;

SELECT * FROM students;
